README.org
#+TITLE: 浮體與繫纜分析--專題研究計算案例規劃
#+DATE: 2025 年 10 月
# OPTIONS: toc:2 num:t
#+CATEGORY: Courses
#+STARTUP: indent
# STARTUP: latexpreview
# Theme setup
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_LINK_UP: index.html
#+HTML_LINK_HOME: index.html
# Latex 设置
#+LATEX_COMPILER: xelatex
#+LaTeX_CLASS_OPTIONS: [hidelinks,a4paper,12pt]
#+LaTeX_HEADER: \usepackage{amssymb}
#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[AUTO]{inputenc}
#+LaTeX_HEADER: \usepackage{geometry}
#+LaTeX_HEADER: \usepackage[nobottomtitles]{titlesec}
#+LaTeX_HEADER: \geometry{verbose,a4paper,tmargin=3.5cm,bmargin=3.5cm,lmargin=3cm,rmargin=3cm}
#+LaTeX_HEADER: \newcommand{\mybaselinestretch}{1.4}
#+LaTeX_HEADER: \renewcommand{\baselinestretch}{\mybaselinestretch}
#+LaTeX_HEADER: \usepackage{xeCJK}
#+LaTeX_HEADER: \usepackage{fontspec,xltxtra,xunicode}
#+LaTeX_HEADER: \setCJKmainfont{cwTeX Q MingZH}
#+LaTeX_HEADER: \setmonofont[Scale=0.8]{Courier New}
#+LaTeX_HEADER: \XeTeXlinebreaklocale "zh"
#+LaTeX_HEADER: \XeTeXlinebreakskip = 0pt plus 1pt
#+LaTeX_HEADER: \parskip=2ex
#+LaTeX_HEADER: \renewcommand{\tablename}{表}
#+LaTeX_HEADER: \renewcommand{\figurename}{圖}
#+LaTeX_HEADER: \renewcommand{\contentsname}{目錄}
#+LaTeX_HEADER: \renewcommand{\refname}{\large 參考文獻}

# Disable table of contents
#+OPTIONS: toc:nil

# Disable section numbering
# #+OPTIONS: num:nil

# New page after TOC
#+begin_export latex
  \clearpage
#+end_export

* 研究目的
本專題以 *foamMooring* 工具箱為基礎，模擬單一矩形浮體（floating body）在不同波浪條件下的運動響應。
藉由系統性地改變波浪週期與波高，分析浮體在三自由度運動（3-DoF） 下的 *RAO（Response Amplitude Operator）*
特性，了解浮體對波浪頻率的動態反應，並探討共振現象與繫泊系統的影響。

研究結果可作為：
1. 浮體動力行為的初步驗證；
2. 對照不同繫泊剛度或幾何設定的參考；
3. 後續延伸研究（例如多浮體干涉、風浪耦合等）的基礎資料。

* 模擬條件概述
根據 Chen and Hall (2022) 的單一浮體案例，本研究採用相同的幾何、繫泊與水槽條件，改變波浪週期與波高兩個主要參數。

** 浮體條件

- 浮體長度 $2b = 0.2~\mathrm{m}$
- 浮體寬度 $0.2~\mathrm{m}$
- 浮體高度 $0.132~\mathrm{m}$
- 初始吃水深度 $d = 0.0786~\mathrm{m}$
- 浮體質量 $3.16~\mathrm{kg}$
- 質量中心 $(x, y, z) = (0, 0, -0.0126)~\mathrm{m}$
- 浮體慣性矩 (I_{xx}, I_{yy}, I_{zz}) = $(0.015, 0.015, 0.021)~\mathrm{kg\, m^2}$
- 靜止水深 $h = 0.5~\mathrm{m}$

** 繫泊條件

- 繫纜單位長度質量 $0.607~\mathrm{g/cm} = 0.0607~\mathrm{kg/m}$
- 繫纜直徑 $0.003656~\mathrm{m}$
- 繫纜長度 $1.455~\mathrm{m}$
- 繫纜軸向剛度 (axial stiffness) $29~\mathrm{N}$
- 繫纜導纜器 (fairlead, 與浮體連接處) $(x, y, z) = (\pm 0.1, \pm 0.1, -0.0736)~\mathrm{m}$
- 繫纜錨定處 (ahcnor, 與底床連接處) $(x, y, z) = (\pm 1.385, \pm 0.423, -0.5)~\mathrm{m}$

** Chen and Hall (2022) 之波浪條件

| 編號    | 週期 $T$ (s) | 波高 $H$ (m) | 波長 $L$ (m) | 波尖銳度 $H/L$ | 相對水深 $h/L$ |
|--------+---------------+---------------+---------------+--------------+----------------|
| H12T18 |           1.8 |          0.12 |          3.57 |       0.0336 |          0.140 |
| H12T20 |           2.0 |          0.12 |          4.06 |       0.0296 |          0.123 |
| H15T18 |           1.8 |          0.15 |          3.57 |       0.0420 |          0.140 |

以相對水深 $(h/L)$ 來分類，以上波浪均屬中間水深波 (intermediate water waves)。波浪尖銳度 (wave steepness) $H/L$ 與波浪的非線性程度有關，但並非一個獨立的分類指標。相對水深之分類為：

- 深水波: $h/L > 1/2$
- 中間水深波: $1/20 < h/L < 1/2$
- 淺水波: $h/L < 1/20$

* 計算條件設定

靜水深 $h = 0.5~\mathrm{m}$, 浮體半寬 $b = 0.1~\mathrm{m}$。
以波數 (wave number) $k = 2\pi/L$ 之倒數為長度之無因次尺度，其中 $L$ 為波長。改變波浪週期 $T$ 可得到不同之 $k$ 值。

規劃相對之浮體寬為 $kb = 0.3 \sim 1.2$, 波浪尖銳度 $ka = 0.05, 0.1$, 其中 $a = H/2$ 為入射波振幅。
計算例設定如下表：


| No. |   kb |   ka |  H (m) |  L (m) | T (s) |
|-----+------+------+--------+--------+-------|
|   1 | 0.30 | 0.05 | 0.0333 | 2.0944 | 1.217 |
|   2 | 0.40 | 0.05 | 0.0250 | 1.5708 | 1.022 |
|   3 | 0.50 | 0.05 | 0.0200 | 1.2566 | 0.903 |
|   4 | 0.60 | 0.05 | 0.0167 | 1.0472 | 0.821 |
|   5 | 0.70 | 0.05 | 0.0143 | 0.8976 | 0.759 |
|   6 | 0.80 | 0.05 | 0.0125 | 0.7854 | 0.709 |
|   7 | 0.90 | 0.05 | 0.0111 | 0.6981 | 0.669 |
|   8 | 1.00 | 0.05 | 0.0100 | 0.6283 | 0.634 |
|   9 | 1.10 | 0.05 | 0.0091 | 0.5712 | 0.605 |
|  10 | 1.20 | 0.05 | 0.0083 | 0.5236 | 0.579 |
|  11 | 0.30 | 0.10 | 0.0667 | 2.0944 | 1.217 |
|  12 | 0.40 | 0.10 | 0.0500 | 1.5708 | 1.022 |
|  13 | 0.50 | 0.10 | 0.0400 | 1.2566 | 0.903 |
|  14 | 0.60 | 0.10 | 0.0333 | 1.0472 | 0.821 |
|  15 | 0.70 | 0.10 | 0.0286 | 0.8976 | 0.759 |
|  16 | 0.80 | 0.10 | 0.0250 | 0.7854 | 0.709 |
|  17 | 0.90 | 0.10 | 0.0222 | 0.6981 | 0.669 |
|  18 | 1.00 | 0.10 | 0.0200 | 0.6283 | 0.634 |
|  19 | 1.10 | 0.10 | 0.0182 | 0.5712 | 0.605 |
|  20 | 1.20 | 0.10 | 0.0167 | 0.5236 | 0.579 |

* 參數意義與物理說明

** 波浪週期 $T~(\mathrm{s})$
波浪週期為相鄰波峰通過同一點所需的時間，決定波浪頻率與能量分佈。
- 短週期波 ($T < 1.4~\mathrm{s}$): 波浪變化快，主要影響 *surge* 運動；
- 長週期波 ($T > 1.6~\mathrm{s}$): 波浪能量集中，容易引發浮體共振。

** 波高 $H~(\mathrm{m})$
波高為波峰與波谷之間的垂直距離，反映波能強度。波高越大，浮體受力與運動幅度越明顯。
- 小波高：系統近似線性，可用於驗證理論模型。
- 大波高：可能產生非線性效應，例如阻尼增加或漂移運動。

** 波長 $L~(\mathrm{m})$
波長代表波峰與波峰之間的水平距離，與週期相關，由頻散關係：

$$
\omega^2 = g k \tanh (kh)
$$

可求得 $L = 2\pi / k$。
波長越長，波浪越「平緩」，對浮體的影響主要為低頻大振幅運動。

** 波陡度 $H/L$
波陡度描述波浪的相對「尖銳程度」，在水力學上常用來判斷波浪是否可能破碎。
一般而言：
- $H/L < 0.02$ 為「緩波」；
- $0.02 < H/L < 0.05$ 為「中等波」；
- $H/L > 0.05$ 則為「陡波」區域，數值模擬需特別注意穩定性。

** 水深 $h~(\mathrm{m})$
水深影響波的傳播速度與波壓分佈。若 $kh > \pi$ 為深水波；若 $kh < \pi/10$ 為淺水波。
本研究之 $h = 0.6~\mathrm{m}$，屬於中等深度（intermediate depth），適合觀察深水與淺水效應交替之情況。

* 實驗步驟建議
1. 先選定基準案例（T = 1.8 s, H = 0.12 m），確認模擬可正常收斂；
2. 再依序執行各週期的掃描；
3. 模擬完成後，取浮體 3DoF 運動時間序列；
4. 計算各自由度的 RAO（振幅比與相位差）;
5. 繪製 RAO vs. 週期圖，觀察共振行為；
6. 彙整結果，分析波浪頻率與振幅對浮體動態特性的影響。

* 分析與討論方向
- 不同波陡度對浮體運動的非線性效應；
- 短波與長波下的共振頻率差異；
- 吃水深度與繫泊剛度對 RAO 峰值的影響；
- CFD 模擬與理論模型的比較（例如 Morison 方程或線性勢流理論）。

* 學習重點
- 理解浮體受波激勵運動的機制；
- 熟悉 OpenFOAM 與 foamMooring 的模擬流程；
- 學習如何設計與執行參數掃描；
- 具備後處理分析（RAO 計算、頻譜分析）的能力；
- 建立對海洋結構物動力行為的直觀理解。

* 延伸方向
完成本階段後，可考慮進一步主題：
1. 探討繫泊剛度對 RAO 曲線的變化；
2. 研究多浮體間的水動力干涉；
3. 考慮風浪同時作用（加入定常風載）；
4. 嘗試使用不同繫泊模型（MoorDyn vs MAP++）比較。
* Overset 計算執行

** 計算指令

在案例主目錄中執行 ~./Allrun.pre~, 可執行平行計算。如需進行單核心計算，則將其修改為

#+begin_src bash
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Mesh floating body
(cd floatingBody && ./Allrun.pre)

## Add background mesh (Parallel computing)
#(cd background  && ./Allrun.pre 1)

# Add background mesh (Single-Core computing)
(cd background  && ./Allrun.pre)

#------------------------------------------------------------------------------

#+end_src

** 平行計算設定

以 ~tutorials/overset_parallel/~ 為例：

** 計算分割數

設定為 4 區，可於 ~background/system/decomposeParDict~ 中設定。

* Overset 網格計算與後處理
** ParaView 繪圖
*** 波浪流場與物體繪製流程

1. 開啟 ~aa.foam~ 檔案：
   #+begin_src bash
   paraview aa.foam
   #+end_src

2. 如要繪製動壓場，可選擇 ~p_rgh~ 並使用 ~Surface~ 繪製。

3. 欲分離出物體，需透過 ~Threshold~ 工具：

   a. 從 ~Pipeline Browser~ 處，在 ~aa.foam~ 點選 ~Threshold~. 出現 ~Threshold 1~ 。在 ~Threshold 1~ 中的 ~Properties~ 之 ~Scalars~ 選擇 ~ZoneID~, 並設定其值之 ~Minimum = 0~, ~Maximum = 0~ 。顯示此 ~Threshold 1~ 並關閉 ~aa.foam~, 可顯示出背景流體。

   b. 在 ~Threshold 1~ 中再做一次 ~Threshold~ 工具，出現 ~Threshold 2~ 。在 ~Threshold 2~ 處之 ~Properties~ 之 ~Scalars~ 選擇 ~cellTypes~, 設定值 ~Minimum = 0~, ~Maximum = 1~ 。開啟 ~Threshold 2~ 並關閉 ~Threshold 1~, 可出現扣除浮體網格之背景流場。

   c. 在 ~aa.foam~ 點選 ~Threshold~, 出現 ~Threshold 3~ 。在 ~Threshold 3~ 中的 ~Properties~ 之 ~Scalars~ 選擇 ~ZoneID~, 並設定其值之 ~Minimum = 1~, ~Maximum = 1~ 。點開 ~Advanced Properties~, 在 ~Transforming~ 中設定 ~Translation = (0, -0.2, 0)~ 。顯示此 ~Threshold 3~ 可出現浮體附近的流場。

   d. 僅開啟 ~Threshold2~ 與 ~Threshold3~, 並在 ~Orientation Axes~ 中點選 ~Camera Paralle Projection~, 可出現浮體被挖空之波浪流場。

*** 繪製繫纜線

1. 在 ParaView 中開啟纜線的 VTK 檔。以 Overset 案例為例，VTK 檔位於
   #+begin_src bash
   background/Mooring/VTK/mdv2_pt.pvd
   #+end_src

2. 在 ~Pipeline Browser~ 中點選 ~mdv2_pt.vtk.pvd~, 使用 ~Transforming~ 將纜線平移到與浮體一樣的位置。
